In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter
import datetime as dt
import itertools

In [308]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
778,tt1657507,40000000,60965854,Colombiana,Zoe Saldana|Cliff Curtis|Callum Blue|Michael V...,Olivier Megaton,Revenge is beautiful.,"Zoe Saldana plays a young woman who, after wit...",108,Action|Thriller|Crime|Drama,TF1 Films Production|Canal+|CinÃ©CinÃ©ma|Grive...,7/27/2011,6.5,2011
246,tt1136608,30000000,210819611,District 9,Sharlto Copley|Jason Cope|Nathalie Boltt|Sylva...,Neill Blomkamp,You are not welcome here.,Aliens land in South Africa and have no way ho...,112,Action|Thriller|Science Fiction,WingNut Films|TriStar Pictures|Key Creatives|B...,8/5/2009,7.1,2009
701,tt0412536,20000000,13204291,Brideshead Revisited,Matthew Goode|Ben Whishaw|Hayley Atwell|Emma T...,Julian Jarrold,Every temptation has its price.,Based on Evelyn Waugh's 1945 classic British n...,133,Drama|Romance,BBC Films|Ecosse Films|HanWay Films|UK Film Co...,7/25/2008,6.0,2008
427,tt0817230,52000000,216485654,Valentine's Day,Jessica Alba|Jessica Biel|Bradley Cooper|Eric ...,Garry Marshall,A Love Story. More or Less.,More than a dozen Angelenos navigate Valentine...,125,Comedy|Romance,New Line Cinema|Karz Entertainment|Rice Films,2/10/2010,5.6,2010
60,tt3076658,35000000,137935567,Creed,Michael B. Jordan|Sylvester Stallone|Graham Mc...,Ryan Coogler,Your legacy is more than a name,The former World Heavyweight Champion Rocky Ba...,133,Drama,New Line Cinema|Warner Bros.|Metro-Goldwyn-May...,11/25/2015,7.3,2015

In [309]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [310]:
answers = {} # создадим словарь для ответов

data['profit'] = data.revenue - data.budget  # Profit formula

data.genres = data.genres.str.split('|')  # Splitting genre strings

data.director = data.director.str.split('|')  # Splitting director strings

data.cast = data.cast.str.split('|')  # Splitting actors strings

data['release_month'] = data['release_date'
        ].apply(lambda x: pd.to_datetime(x, format="%m/%d/%Y").month)  # Getting the month from date string

In [236]:
""" Alternative solution for task 11. Hard long way) using dictionary """
    

def genre_max_func(df):
    
    genres_dict = {}
    genre_max = 0

    for line in df.genres:                    # Converting 'genres' column to dictionary
        for genre in line:
            if genre in genres_dict:
                genres_dict[genre] += 1
            else:
                genres_dict[genre] = 1

    for key in genres_dict:                   # Looking for max value in dictionary
        genre_value = genres_dict[key]
        if genre_max < genre_value:
            genre_max = genre_value
            genre_max_key = key

    return genre_max_key, genre_max

In [457]:
""" Solution to generate actors combinations for task 27 """

def cast_combinations(column):
    a = []
    for c in itertools.combinations(column, 2):
        a.append(c)
    return a

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [519]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = '723. Pirates of the Caribbean: On Stranger Tides (tt1298650)'
# если ответили верно, можете добавить комментарий со значком "+"

In [334]:
data_1 = data.copy()
data_1.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month
0,tt0369610,150000000,1513528810,Jurassic World,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...",[Colin Trevorrow],The park is open.,Twenty-two years after the events of Jurassic ...,124,"[Action, Adventure, Science Fiction, Thriller]",Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,6
1,tt1392190,150000000,378436354,Mad Max: Fury Road,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...",[George Miller],What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,"[Action, Adventure, Science Fiction, Thriller]",Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,5
2,tt2908446,110000000,295238201,Insurgent,"[Shailene Woodley, Theo James, Kate Winslet, A...",[Robert Schwentke],One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,"[Adventure, Science Fiction, Thriller]",Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,3

In [335]:
data_1.query('budget == budget.max()')[['original_title', 'imdb_id']]

                                  original_title    imdb_id
723  Pirates of the Caribbean: On Stranger Tides  tt1298650

ВАРИАНТ 2

In [336]:
data_1.describe()

,budget,revenue,runtime,vote_average,release_year,profit,release_month
count,1.889000e+03,1.889000e+03,1889.000000,1889.000000,1889.000000,1.889000e+03,1889.000000
mean,5.431083e+07,1.553653e+08,109.658549,6.140762,2007.860773,1.010545e+08,6.933298
std,4.858721e+07,2.146698e+08,18.017041,0.764763,4.468841,1.830733e+08,3.390196
min,5.000000e+06,2.033165e+06,63.000000,3.300000,2000.000000,-1.657101e+08,1.000000
25%,2.000000e+07,3.456058e+07,97.000000,5.600000,2004.000000,5.000000e+06,4.000000
50%,3.800000e+07,8.361541e+07,107.000000,6.100000,2008.000000,4.400041e+07,7.000000
75%,7.200000e+07,1.782626e+08,120.000000,6.600000,2012.000000,1.201842e+08,10.000000
max,3.800000e+08,2.781506e+09,214.000000,8.100000,2015.000000,2.544506e+09,12.000000

In [337]:
data_1.describe().iloc[-1].budget

380000000.0

In [338]:
data_1[data_1.budget == data_1.describe().iloc[-1].budget][['original_title', 'imdb_id']]

                                  original_title    imdb_id
723  Pirates of the Caribbean: On Stranger Tides  tt1298650

# 2. Какой из фильмов самый длительный (в минутах)?

In [520]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = '1157. Gods and Generals (tt0279111)'

In [339]:
data_2 = data.copy()
data_2.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month
0,tt0369610,150000000,1513528810,Jurassic World,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...",[Colin Trevorrow],The park is open.,Twenty-two years after the events of Jurassic ...,124,"[Action, Adventure, Science Fiction, Thriller]",Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,6
1,tt1392190,150000000,378436354,Mad Max: Fury Road,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...",[George Miller],What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,"[Action, Adventure, Science Fiction, Thriller]",Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,5
2,tt2908446,110000000,295238201,Insurgent,"[Shailene Woodley, Theo James, Kate Winslet, A...",[Robert Schwentke],One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,"[Adventure, Science Fiction, Thriller]",Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,3

In [340]:
data_2[data_2.runtime == data_2.runtime.max()][['original_title', 'imdb_id']]

         original_title    imdb_id
1157  Gods and Generals  tt0279111

# 3. Какой из фильмов самый короткий (в минутах)?

In [517]:
answers['3'] = '768. Winnie the Pooh (tt1449283)'

In [342]:
data_3 = data.copy()
data_3.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month
0,tt0369610,150000000,1513528810,Jurassic World,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...",[Colin Trevorrow],The park is open.,Twenty-two years after the events of Jurassic ...,124,"[Action, Adventure, Science Fiction, Thriller]",Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,6
1,tt1392190,150000000,378436354,Mad Max: Fury Road,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...",[George Miller],What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,"[Action, Adventure, Science Fiction, Thriller]",Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,5
2,tt2908446,110000000,295238201,Insurgent,"[Shailene Woodley, Theo James, Kate Winslet, A...",[Robert Schwentke],One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,"[Adventure, Science Fiction, Thriller]",Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,3

In [343]:
data_3.query('runtime == runtime.min()')[['original_title', 'imdb_id']]

      original_title    imdb_id
768  Winnie the Pooh  tt1449283

# 4. Какова средняя длительность фильмов?

In [489]:
answers['4'] = '109.6585494970884'

In [344]:
data_4 = data.copy()
data_4.runtime.mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [490]:
answers['5'] = '107.0'

In [345]:
data_5 = data.copy()
data_5.runtime.median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [491]:
answers['6'] = '239. Avatar (tt0499549)'

In [346]:
# лучше код получения столбца profit вынести в Предобработку что в начале
data_6 = data.copy()
data_6.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month
0,tt0369610,150000000,1513528810,Jurassic World,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...",[Colin Trevorrow],The park is open.,Twenty-two years after the events of Jurassic ...,124,"[Action, Adventure, Science Fiction, Thriller]",Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,6
1,tt1392190,150000000,378436354,Mad Max: Fury Road,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...",[George Miller],What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,"[Action, Adventure, Science Fiction, Thriller]",Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,5
2,tt2908446,110000000,295238201,Insurgent,"[Shailene Woodley, Theo James, Kate Winslet, A...",[Robert Schwentke],One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,"[Adventure, Science Fiction, Thriller]",Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,3

In [347]:
data_6.query('profit == profit.max()')[['original_title', 'imdb_id']]

    original_title    imdb_id
239         Avatar  tt0499549

# 7. Какой фильм самый убыточный?

In [492]:
answers['7'] = '1245. The Lone Ranger (tt1210819)'

In [348]:
data_7 = data.copy()
data_7.query('profit == profit.min()')[['original_title', 'imdb_id']]

       original_title    imdb_id
1245  The Lone Ranger  tt1210819

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [493]:
answers['8'] = '1478'

In [349]:
data_8 = data.copy()
data_8.query('profit > 0').count()[0]

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [494]:
answers['9'] = '599. The Dark Knight (tt0468569)'

In [350]:
data_9 = data.copy()
data_9.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month
0,tt0369610,150000000,1513528810,Jurassic World,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...",[Colin Trevorrow],The park is open.,Twenty-two years after the events of Jurassic ...,124,"[Action, Adventure, Science Fiction, Thriller]",Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,6
1,tt1392190,150000000,378436354,Mad Max: Fury Road,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...",[George Miller],What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,"[Action, Adventure, Science Fiction, Thriller]",Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,5
2,tt2908446,110000000,295238201,Insurgent,"[Shailene Woodley, Theo James, Kate Winslet, A...",[Robert Schwentke],One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,"[Adventure, Science Fiction, Thriller]",Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,3

In [351]:
data_9.query('release_year == 2008').sort_values(
    'revenue', ascending=False)[['original_title', 'imdb_id']].head(1)

      original_title    imdb_id
599  The Dark Knight  tt0468569

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [495]:
answers['10'] = '1245. The Lone Ranger (tt1210819)'

In [353]:
data_10 = data.copy()
data_10 = data_10[['original_title', 'imdb_id', 'release_year', 'profit']]
data_10.head(3)

       original_title    imdb_id  release_year      profit
0      Jurassic World  tt0369610          2015  1363528810
1  Mad Max: Fury Road  tt1392190          2015   228436354
2           Insurgent  tt2908446          2015   185238201

In [477]:
data_10[
        (data_10.release_year >= 2012) & (data_10.release_year <= 2014)
        ].sort_values('profit').iloc[:1, :2]

       original_title    imdb_id
1245  The Lone Ranger  tt1210819

# 11. Какого жанра фильмов больше всего?

In [496]:
answers['11'] = 'Drama'

In [355]:
data_11 = data.copy()
data_11 = data_11[['original_title', 'genres']]
data_11.head(3)

       original_title                                          genres
0      Jurassic World  [Action, Adventure, Science Fiction, Thriller]
1  Mad Max: Fury Road  [Action, Adventure, Science Fiction, Thriller]
2           Insurgent          [Adventure, Science Fiction, Thriller]

In [356]:
data_11.genres.explode().value_counts().index[0]

'Drama'

ВАРИАНТ 2

In [357]:
genre_max_func(data_11)[0]   # Function is in the preprocessing

'Drama'

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [497]:
answers['12'] = 'Drama'

In [358]:
data_12 = data.copy()
data_12 = data_12[['genres', 'profit']]
data_12.head(3)

                                           genres      profit
0  [Action, Adventure, Science Fiction, Thriller]  1363528810
1  [Action, Adventure, Science Fiction, Thriller]   228436354
2          [Adventure, Science Fiction, Thriller]   185238201

In [478]:
data_12.query('profit > 0').genres.explode().value_counts(normalize=True).index[0]

Drama              0.141343
Comedy             0.139071
Thriller           0.112569
Action             0.112065
Adventure          0.085058
Romance            0.061080
Crime              0.058304
Family             0.057042
Science Fiction    0.049218
Fantasy            0.047451
Horror             0.037860
Animation          0.030288
Mystery            0.030035
Music              0.011863
History            0.011610
War                0.010348
Western            0.003029
Documentary        0.001767
Name: genres, dtype: float64

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [498]:
answers['13'] = 'Peter Jackson'

In [255]:
data_13 = data.copy()
data_13 = data_13[['director', 'revenue']]
data_13.head(3)

             director     revenue
0   [Colin Trevorrow]  1513528810
1     [George Miller]   378436354
2  [Robert Schwentke]   295238201

In [256]:
data_13.explode('director').groupby('director').sum().sort_values('revenue', ascending=False).index[0]

'Peter Jackson'

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [499]:
answers['14'] = 'Robert Rodriguez'

In [299]:
data_14 = data.copy()
data_14 = data_14[['director', 'genres']]
data_14.head(3)

             director                                          genres
0   [Colin Trevorrow]  [Action, Adventure, Science Fiction, Thriller]
1     [George Miller]  [Action, Adventure, Science Fiction, Thriller]
2  [Robert Schwentke]          [Adventure, Science Fiction, Thriller]

In [479]:
data_14.explode('genres').query('genres == "Action"'
        ).explode('director').groupby('director'
        ).count().sort_values('genres', ascending=False).index[0]

'Robert Rodriguez'

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [500]:
answers['15'] = 'Chris Hemsworth'

In [316]:
data_15 = data.copy()
data_15 = data_15.query('release_year == 2012')[['cast', 'revenue']]
data_15.head(3)

                                                  cast     revenue
970  [Robert Downey Jr., Chris Evans, Mark Ruffalo,...  1519557910
971  [Kate Beckinsale, Stephen Rea, Michael Ealy, T...   132400000
972  [Christian Bale, Michael Caine, Gary Oldman, A...  1081041287

In [317]:
data_15.explode('cast').groupby('cast').sum().sort_values('revenue', ascending=False).index[0]

'Chris Hemsworth'

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [501]:
answers['16'] = 'Matt Damon'

In [315]:
data_16 = data.copy()
data_16 = data_16[['cast', 'budget']]
data_16.head(3)

                                                cast     budget
0  [Chris Pratt, Bryce Dallas Howard, Irrfan Khan...  150000000
1  [Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...  150000000
2  [Shailene Woodley, Theo James, Kate Winslet, A...  110000000

In [318]:
data_16.query('budget > budget.mean()').explode('cast').value_counts('cast').index[0]

'Matt Damon'

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [502]:
answers['17'] = 'Action'

In [320]:
data_17 = data.copy()
data_17 = data_17[['cast', 'genres']]
data_17.head(3)

,cast,genres
0,"[Chris Pratt, Bryce Dallas Howard, Irrfan Khan...","[Action, Adventure, Science Fiction, Thriller]"
1,"[Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...","[Action, Adventure, Science Fiction, Thriller]"
2,"[Shailene Woodley, Theo James, Kate Winslet, A...","[Adventure, Science Fiction, Thriller]"

In [331]:
data_17.explode('cast').query('cast == "Nicolas Cage"').explode('genres').value_counts().index[0][1]

'Action'

# 18. Самый убыточный фильм от Paramount Pictures

In [503]:
answers['18'] = 'K-19: The Widowmaker'

In [332]:
data_18 = data.copy()
data_18 = data_18[['original_title', 'production_companies', 'profit']]
data_18.head(3)

,original_title,production_companies,profit
0,Jurassic World,Universal Studios|Amblin Entertainment|Legenda...,1363528810
1,Mad Max: Fury Road,Village Roadshow Pictures|Kennedy Miller Produ...,228436354
2,Insurgent,Summit Entertainment|Mandeville Films|Red Wago...,185238201

In [333]:
data_18[data_18.production_companies.str.contains('Paramount Pictures')
       ].sort_values('profit').iloc[0, 0]

'K-19: The Widowmaker'

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [504]:
answers['19'] = '2015'

In [360]:
data_19 = data.copy()
data_19 = data_19[['release_year', 'revenue']]
data_19.head(3)

   release_year     revenue
0          2015  1513528810
1          2015   378436354
2          2015   295238201

In [361]:
data_19.groupby('release_year').sum().sort_values('revenue', ascending=False).index[0]

2015

# 20. Какой самый прибыльный год для студии Warner Bros?

In [505]:
answers['20'] = '2014'

In [362]:
data_20 = data.copy()
data_20 = data_20[['production_companies', 'release_year', 'profit']]
data_20.head(3)

                                production_companies  release_year      profit
0  Universal Studios|Amblin Entertainment|Legenda...          2015  1363528810
1  Village Roadshow Pictures|Kennedy Miller Produ...          2015   228436354
2  Summit Entertainment|Mandeville Films|Red Wago...          2015   185238201

In [363]:
data_20[data.production_companies.str.contains('Warner Bros')
       ].groupby('release_year').sum().sort_values('profit', ascending=False).index[0]

2014

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [506]:
answers['21'] = '9'

In [364]:
data_21 = data.copy()
data_21 = data_21[['release_month', 'original_title']]
data_21.head(3)

   release_month      original_title
0              6      Jurassic World
1              5  Mad Max: Fury Road
2              3           Insurgent

In [365]:
data_21.groupby('release_month').count().sort_values('original_title', ascending=False).index[0]

9

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [507]:
answers['22'] = '450'

In [366]:
data_22 = data.copy()
data_22 = data_22[['release_month']]
data_22.head(3)

   release_month
0              6
1              5
2              3

In [367]:
len(data_22.query('release_month in [6, 7, 8]'))

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [508]:
answers['23'] = 'Peter Jackson'

In [369]:
data_23 = data.copy()
data_23 = data_23[['director', 'release_month']]
data_23.head(3)

             director  release_month
0   [Colin Trevorrow]              6
1     [George Miller]              5
2  [Robert Schwentke]              3

In [374]:
data_23.query('release_month in [1, 2, 12]').explode('director').value_counts('director').index[0]

'Peter Jackson'

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [509]:
answers['24'] = 'Four By Two Productions'

In [379]:
data_24 = data.copy()
data_24 = data_24[['production_companies', 'original_title']]
data_24.head(3)

                                production_companies      original_title
0  Universal Studios|Amblin Entertainment|Legenda...      Jurassic World
1  Village Roadshow Pictures|Kennedy Miller Produ...  Mad Max: Fury Road
2  Summit Entertainment|Mandeville Films|Red Wago...           Insurgent

In [380]:
data_24.production_companies = data_24.production_companies.str.split('|')

In [390]:
data_24 = data_24.explode('production_companies')
data_24.head(3)

   production_companies  original_title
0     Universal Studios  Jurassic World
0  Amblin Entertainment  Jurassic World
0    Legendary Pictures  Jurassic World

In [391]:
data_24['len_original_title'] = data_24.original_title.apply(lambda x: len(x))
data_24.head()

      production_companies  original_title  len_original_title
0        Universal Studios  Jurassic World                  14
0     Amblin Entertainment  Jurassic World                  14
0       Legendary Pictures  Jurassic World                  14
0  Fuji Television Network  Jurassic World                  14
0                   Dentsu  Jurassic World                  14

In [401]:
data_24.groupby('production_companies').mean().sort_values('len_original_title', ascending=False).index[0]

'Four By Two Productions'

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [510]:
answers['25'] = 'Midnight Picture Show'

In [419]:
data_25 = data.copy()
data_25 = data_25[['production_companies', 'overview']]
data_25.head(3)

,production_companies,overview
0,Universal Studios|Amblin Entertainment|Legenda...,Twenty-two years after the events of Jurassic ...
1,Village Roadshow Pictures|Kennedy Miller Produ...,An apocalyptic story set in the furthest reach...
2,Summit Entertainment|Mandeville Films|Red Wago...,Beatrice Prior must confront her inner demons ...

In [420]:
data_25.production_companies = data_25.production_companies.str.split('|')

In [421]:
data_25.overview = data_25.overview.str.split(' ')

In [422]:
data_25 = data_25.explode('production_companies')
data_25.head(3)

   production_companies                                           overview
0     Universal Studios  [Twenty-two, years, after, the, events, of, Ju...
0  Amblin Entertainment  [Twenty-two, years, after, the, events, of, Ju...
0    Legendary Pictures  [Twenty-two, years, after, the, events, of, Ju...

In [424]:
data_25['len_overview'] = data_25.overview.apply(lambda x: len(x))
data_25.sample(3)

,production_companies,overview,len_overview
173,Warner Bros.,"[After, a, bad, blind, date,, a, man, and, wom...",31
1706,DNA Films,"[In, this, chilling, sequel, to, 28, Days, Lat...",76
1006,Tim Burton Productions,"[President, Lincoln's, mother, is, killed, by,...",20

In [428]:
data_25.groupby('production_companies').mean().sort_values('len_overview', ascending=False).index[0]

'Midnight Picture Show'

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [514]:
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave'

In [430]:
data_26 = data.copy()
data_26 = data_26[['original_title', 'vote_average']]
data_26.head(3)

       original_title  vote_average
0      Jurassic World           6.5
1  Mad Max: Fury Road           7.1
2           Insurgent           6.3

In [445]:
data_26[data_26.vote_average >= data_26.vote_average.quantile(0.99)
       ].sort_values('vote_average', ascending=False).original_title

599                                       The Dark Knight
9                                              Inside Out
34                                                   Room
118                                          Interstellar
125                                    The Imitation Game
370                                             Inception
1191                                     12 Years a Slave
1183                              The Wolf of Wall Street
1081        The Lord of the Rings: The Return of the King
872                                           The Pianist
1800                                              Memento
119                               Guardians of the Galaxy
138                              The Grand Budapest Hotel
128                                             Gone Girl
283                                            Mr. Nobody
1688                                  There Will Be Blood
1563                Eternal Sunshine of the Spotless Mind
1444                                         The Prestige
1213                                   Dallas Buyers Club
1205                                            Prisoners
124                                            Big Hero 6
1188                                                  Her
316                                              3 Idiots
863                 The Lord of the Rings: The Two Towers
155                              The Theory of Everything
28                                              Spotlight
177                                The Fault in Our Stars
496     The Lord of the Rings: The Fellowship of the Ring
Name: original_title, dtype: object

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [515]:
answers['27'] = "('Daniel Radcliffe', 'Emma Watson'), ('Daniel Radcliffe', 'Rupert Grint')"

In [464]:
data_27 = data.copy()
data_27 = data_27[['cast']]
data_27.head(3)

                                                cast
0  [Chris Pratt, Bryce Dallas Howard, Irrfan Khan...
1  [Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...
2  [Shailene Woodley, Theo James, Kate Winslet, A...

In [465]:
# Generating actor pairs in each line of cast column with func from preprocessing.

data_27['cast'] = data_27.cast.apply(lambda x: cast_combinations(x))

In [466]:
data_27.head(3)

                                                cast
0  [(Chris Pratt, Bryce Dallas Howard), (Chris Pr...
1  [(Tom Hardy, Charlize Theron), (Tom Hardy, Hug...
2  [(Shailene Woodley, Theo James), (Shailene Woo...

In [485]:
data_27.explode('cast').value_counts().index[0:2]

MultiIndex([( ('Daniel Radcliffe', 'Emma Watson'),),
            (('Daniel Radcliffe', 'Rupert Grint'),)],
           names=['cast'])

# Submission

In [521]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'3': '768. Winnie the Pooh (tt1449283)',
 '1': '723. Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': '1157. Gods and Generals (tt0279111)',
 '4': '109.6585494970884',
 '5': '107.0',
 '6': '239. Avatar (tt0499549)',
 '7': '1245. The Lone Ranger (tt1210819)',
 '8': '1478',
 '9': '599. The Dark Knight (tt0468569)',
 '10': '1245. The Lone Ranger (tt1210819)',
 '11': 'Drama',
 '12': 'Drama',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker',
 '19': '2015',
 '20': '2014',
 '21': '9',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave',
 '27': "('Daniel Radcliffe', 'Emma Watson'), ('Daniel Radcliffe', 'Rupert Grint')"}

In [522]:
# и убедиться что ни чего не пропустил)
len(answers)

27